app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 07 Nov 2013 04:04:59 UTC +00:00], ["description", "aaa"], ["title", "aaa"], ["updated_at", Thu, 07 Nov 2013 04:04:59 UTC +00:00]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = 4  [["title", "aaa"], ["updated_at", Thu, 07 Nov 2013 07:38:10 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)