app/controllers/dining_offer_controller.rb

INSERT INTO "dining_offers" ("created_at", "description", "image_url", "restaurant_id", "title", "updated_at", "web_url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
  	@dining_offer = DiningOffer.new(offer_params)

  	respond_to do |format|
      if @dining_offer.save

DELETE FROM "dining_offers" WHERE "dining_offers"."id" = $1  [["id", 26]]
SELECT "dining_offers".* FROM "dining_offers"
---
  def destroy
  	@dining_offer.destroy

  	respond_to do |format|
  		dining_offers = DiningOffer.all

SELECT "dining_offers".* FROM "dining_offers" WHERE "dining_offers"."id" = $1 LIMIT 1  [["id", "26"]]
---
  def set_offer
    @dining_offer = DiningOffer.find(params[:id])