app/controllers/photo_controller.rb

INSERT INTO "photos" ("created_at", "description", "img_thumb_url", "img_url", "profile_id", "restaurant_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save

DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 11]]
SELECT "photos".* FROM "photos"
---
  def destroy
    @photo.destroy

    respond_to do |format|
      photos = Photo.all