app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 07 Nov 2013 08:18:14 UTC +00:00], ["name", "aaa"], ["price", 12.0], ["updated_at", Thu, 07 Nov 2013 08:18:14 UTC +00:00]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save