app/controllers/profile_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def get_todo_restaurants
    @profile = Profile.find(params[:id])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "todo_restaurants" ("created_at", "profile_id", "restaurant_id", "status", "updated_at") VALUES ($1, $2, $3, $4, $5)  [["created_at", Tue, 05 Nov 2013 10:46:41 UTC +00:00], ["profile_id", 1], ["restaurant_id", 1], ["status", 1], ["updated_at", Tue, 05 Nov 2013 10:46:41 UTC +00:00]]
---
  def add_todo
    @profile = Profile.find(params[:id])
    @todo = @profile.todo_restaurants.build(todo_params)

    if @todo.save

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "todo_restaurants" WHERE "todo_restaurants"."profile_id" = 1 AND "todo_restaurants"."restaurant_id" = 1
---
  def done_todo

    @profile = Profile.find(params[:id])

    @todo = @profile.get_todo_with_restaurant_id(params[:restaurant_id])

    p "-------------"
    p "profile_id = #{@todo.profile_id}"
    p "restaurant_id = #{@todo.restaurant_id}"
    p "status = #{@todo.status}"
    p "-------------"

    unless @todo.nil?

      TodoRestaurant.delete_all(profile_id: @todo.profile_id, restaurant_id: @todo.restaurant_id)

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def get_favourite_restaurants
    @profile = Profile.find(params[:id])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", "330"]]
INSERT INTO "favourite_restaurants" ("created_at", "profile_id", "restaurant_id", "status", "updated_at") VALUES ($1, $2, $3, $4, $5)  [["created_at", Wed, 06 Nov 2013 03:46:08 UTC +00:00], ["profile_id", 350], ["restaurant_id", 1], ["status", 1], ["updated_at", Wed, 06 Nov 2013 03:46:08 UTC +00:00]]
---
  def add_favourite
    @profile = Profile.find(params[:id])
    @favourite = @profile.favourite_restaurants.build(favourite_params)

    if @favourite.save

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", "336"]]
DELETE FROM "favourite_restaurants" WHERE "favourite_restaurants"."profile_id" = 366 AND "favourite_restaurants"."restaurant_id" = 238
---
  def remove_favourite

    @profile = Profile.find(params[:id])

    @favourite = @profile.get_favourite_with_restaurant_id(params[:restaurant_id])

    p "-------------"
    p "profile_id = #{@favourite.profile_id}"
    p "restaurant_id = #{@favourite.restaurant_id}"
    p "status = #{@favourite.status}"
    p "-------------"

    unless @favourite.nil?

      FavouriteRestaurant.delete_all(profile_id: @favourite.profile_id, restaurant_id: @favourite.restaurant_id)

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    profile = Profile.find(params[:id])

INSERT INTO "profiles" ("created_at", "email", "name", "profile_icon", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 08 Nov 2013 03:45:37 UTC +00:00], ["email", "trung.ungtoan@asnet.com.vn"], ["name", "trung"], ["profile_icon", "abc"], ["updated_at", Fri, 08 Nov 2013 03:45:37 UTC +00:00]]
---
  def create
  	@profile = Profile.new(profile_params)

  	respond_to do |format|
      if @profile.save

DELETE FROM "profiles" WHERE "profiles"."id" = $1  [["id", 120]]
SELECT "profiles".* FROM "profiles"
---
  def destroy
  	@profile.destroy

  	respond_to do |format|
  		profiles = Profile.all