app/controllers/restaurant_controller.rb

INSERT INTO "restaurants" ("address", "contact", "created_at", "cuisine", "name", "raiting", "updated_at", "web_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
  	@restaurant = Restaurant.new(restaurant_params)

  	respond_to do |format|
      if @restaurant.save

DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 41]]
SELECT "restaurants".* FROM "restaurants"
---
  def destroy
  	@restaurant.destroy

  	respond_to do |format|
  		restaurants = Restaurant.all