app/controllers/review_controller.rb

  def create
  	@review = Review.new(review_params)

  	respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("content", "created_at", "profile_id", "restaurant_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "abc abc def"], ["created_at", Tue, 05 Nov 2013 09:46:01 UTC +00:00], ["profile_id", 1], ["restaurant_id", 1], ["updated_at", Tue, 05 Nov 2013 09:46:01 UTC +00:00]]

  def destroy
  	@review.destroy

  	respond_to do |format|
  		reviews = Review.all
---
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 12]]
SELECT "reviews".* FROM "reviews"